init.org
#+TITLE: Emacs init file written in org-mode
#+STARTUP: indent
#+LANGUAGE: en

* requirements

** set UTF encoding
#+BEGIN_SRC emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC
** package archives
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
       '("melpa" . "http://melpa.org/packages/") t)
(add-to-list 'package-archives
             '("tromey" . "http://tromey.com/elpa/") t)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)

(package-initialize)
(when (not package-archive-contents)
  (package-refresh-contents))

#+end_src
** require
#+begin_src emacs-lisp
(require 'transpose-frame)
(require 'ob-ipython)
(require 'conda)
(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'prog-mode-hook 'company-mode)
(with-eval-after-load 'company
  (add-to-list 'company-backends 'company-anaconda))

(add-hook 'python-mode-hook 'anaconda-mode)
(add-hook 'python-mode-hook 'lpy-mode)
#+end_src
** beacon
#+BEGIN_SRC emacs-lisp
;; Make cursor more visible when you move a long distance
(use-package beacon
  :config
  (beacon-mode 1))
#+END_SRC
** ivy bibtex
#+BEGIN_SRC emacs-lisp
(autoload 'ivy-bibtex "ivy-bibtex" "" t)

#+END_SRC
** my packages
#+begin_src emacs-lisp

(defvar myPackages
  '(better-defaults
    ein ;; add the ein (Emacs ipython notebook)
    elpy ;; add the elpy package
    flycheck ;; add the flycheck package
    conda
    py-autopep8
    paredit ;; makes handling lisp expressions much, much easier
    clojure-mode ;; key bindings and code colorization for Clojure
    clojure-mode-extra-font-locking  ;; extra syntax highlighting for clojure
    cider  ;; integration with a Clojure REPL
    ;;ido-ubiquitous ;;allow ido usage in as many contexts as possible
    projectile 
    rainbow-delimiters  ;; colorful parenthesis matching
    tagedit   ;; edit html tags like sexps
))

(dolist (p myPackages)
  (when (not (package-installed-p p))
    (package-install p)))


#+end_src
** load other elisp files
#+BEGIN_SRC emacs-lisp
;; (add-to-list 'load-path "~/.emacs.d")
;; (require 'scimax-org-babel-ipython)
#+END_SRC
** ivy
#+BEGIN_SRC emacs-lisp
;;(add-to-list 'load-path "~/git/swiper/") (require 'ivy) 
;;(ivy-mode 1) 
;; for new users:
;;(setq ivy-use-virtual-buffers t) (setq ivy-count-format "(%d/%d) ") 
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
#+END_SRC
** IDO
#+begin_src emacs-lisp
(require 'ido) ;;interactively do things...
(ido-mode t)

(add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
(load-theme 'zenburn t)

;; Define he following variables to remove the compile-log warnings
;; when defining ido-ubiquitous
;; (defvar ido-cur-item nil)
;; (defvar ido-default-item nil)
;; (defvar ido-cur-list nil)
;; (defvar predicate nil)
;; (defvar inherit-input-method nil)

#+END_SRC
** package
#+BEGIN_SRC emacs-lisp
(mapc #'(lambda (package)
    (unless (package-installed-p package)
      (package-install package)))
      myPackages)
#+end_src
** pdf-tools
#+BEGIN_SRC emacs-lisp
(pdf-tools-install)
(setq pdf-view-use-unicode-ligther nil)
#+END_SRC
** some python commented functionality
#+begin_src emacs-lisp

;;(elpy-enable)
;; (elpy-use-ipython)

;; (when (require 'flycheck nil t)
  ;; (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  ;; (add-hook 'elpy-mode-hook 'flycheck-mode))

;; (add-hook 'anaconda-mode-hook 'flycheck-mode)

;; (require 'py-autopep8)
;; (add-hook 'anaconda-mode-hook 'py-autopep8-enable-on-save)

#+end_src
** python enviornment (test)
,#+BEGIN_SRC emacs-lisp
(setenv "PYTHONPATH" "/home/adam/anaconda3/bin/ipython3")
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
,#+END_SRC

#+BEGIN_SRC emacs-lisp
(setenv "IPY_TEST_SIMPLE_PROMPT" "1")
#+END_SRC

** ipython interperter
#+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "/home/adam/anaconda3/bin/ipython3")
(setq ob-ipython-command "/home/adam/anaconda3/bin/jupyter")
#+END_SRC
** outshine for python and org 
#+BEGIN_SRC emacs-lisp
(defun python-mode-outline-hook ()
  (setq outline-level 'python-outline-level)

  (setq outline-regexp
    (rx (or
         ;; Commented outline heading
         (group
          (* space)  ; 0 or more spaces
          (one-or-more (syntax comment-start))
          (one-or-more space)
          ;; Heading level
          (group (repeat 1 8 "\*"))  ; Outline stars
          (one-or-more space))

         ;; Python keyword heading
         (group
          ;; Heading level
          (group (* space)) ; 0 or more spaces
          bow
          ;; Keywords
          (or "class" "def" "else" "elif" "except" "for" "if" "try" "while")
          eow)))))

(defun python-outline-level ()
  (or
   ;; Commented outline heading
   (and (string-match (rx
               (* space)
               (one-or-more (syntax comment-start))
               (one-or-more space)
               (group (one-or-more "\*"))
               (one-or-more space))
              (match-string 0))
    (- (match-end 0) (match-beginning 0)))

   ;; Python keyword heading, set by number of indentions
   ;; Add 8 (the highest standard outline level) to every Python keyword heading
   (+ 8 (- (match-end 0) (match-beginning 0)))))

(add-hook 'python-mode-hook 'python-mode-outline-hook)

#+END_SRC
** scimax path inclusion
#+BEGIN_SRC emacs-lisp
(setq scimax-dir "/home/adam/scimax/")
(add-to-list 'load-path "/home/adam/scimax/") ;; TODO find how to require from scimax
#+END_SRC
** js2
#+BEGIN_SRC emacs-lisp
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))

;; Better imenu
(add-hook 'js2-mode-hook #'js2-imenu-extras-mode)
#+END_SRC
** js2-refractor and xref-js2
#+BEGIN_SRC emacs-lisp
(require 'js2-refactor)
(require 'xref-js2)

(add-hook 'js2-mode-hook #'js2-refactor-mode)
(js2r-add-keybindings-with-prefix "C-c C-r")
(define-key js2-mode-map (kbd "C-k") #'js2r-kill)

;; js-mode (which js2 is based on) binds "M-." which conflicts with xref, so
;; unbind it.
(define-key js-mode-map (kbd "M-.") nil)

(add-hook 'js2-mode-hook (lambda ()
  (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t)))
#+END_SRC
** js2 company and tern
,#+BEGIN_SRC emacs-lisp
(require 'company)
(require 'company-tern)

(add-to-list 'company-backends 'company-tern)
(add-hook 'js2-mode-hook (lambda ()
                           (tern-mode)
                           (company-mode)))
                           
;; Disable completion keybindings, as we use xref-js2 instead
(define-key tern-mode-keymap (kbd "M-.") nil)
(define-key tern-mode-keymap (kbd "M-,") nil)
#+END_SRC
** indium
#+BEGIN_SRC emacs-lisp

(use-package indium
  :ensure t
  :diminish (indium-interaction-mode . "In" )
  :init
  (add-hook 'js2-mode-hook #'indium-interaction-mode))

(use-package simple-httpd
  :ensure t)
#+END_SRC

** ledger 
#+BEGIN_SRC emacs-lisp
(require 'ledger-mode)
#+END_SRC

** LaTeX
#+BEGIN_SRC emacs-lisp
(require 'ob-latex)
#+END_SRC
** Lispy
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook (lambda () (lispy-mode 1)))
(add-hook 'lisp-interaction-mode-hook (lambda () (lispy-mode 1)))
#+END_SRC
*** evaluate with lispy in minibuffer
#+BEGIN_SRC emacs-lisp
(defun conditionally-enable-lispy ()
  (when (eq this-command 'eval-expression)
    (lispy-mode 1)))
(add-hook 'minibuffer-setup-hook 'conditionally-enable-lispy)
#+END_SRC
** evil
#+BEGIN_SRC emacs-lisp
(setq evil-default-state 'emacs)    ;starts in emacs-state (C-z to toggle)
(add-to-list 'load-path "~/.emacs.d/evil")
(require 'evil)
(evil-mode 1) ;positively start evil-mode when starting new buffer
#+END_SRC
* general functionality
** projectile
#+BEGIN_SRC emacs-lisp
(projectile-global-mode)
#+END_SRC
** parenthesis
#+BEGIN_SRC emacs-lisp
(load-library "paren")
(show-paren-mode 1)
(transient-mark-mode t)
(require 'paren)
#+END_SRC
** TODO rainbow parenthesis
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook (lambda () (rainbow-delimiters-mode 1)))
(add-hook 'lisp-interaction-mode (lambda() (rainbow-delimiters-mode 1)))
(add-hook 'clojure-mode (lambda() (rainbow-delimiters-mode 1)))
;;(global-rainbow-delimiters-mode t)
#+END_SRC
** Yes or no to y/n
#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** spaceline 
#+BEGIN_SRC emacs-lisp
(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
    (setq spaceline-buffer-encoding-abbrev-p nil)
    (setq spaceline-line-column-p nil)
    (setq spaceline-line-p nil)
    (setq powerline-default-separator (quote arrow))
    (spaceline-spacemacs-theme))
#+END_SRC

** which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :config
    (which-key-mode))
#+END_SRC

** switch-window
#+BEGIN_SRC emacs-lisp
(use-package switch-window
  :ensure t
  :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
        '("a" "s" "d" "f" "j" "k" "l" "i" "o"))
  :bind
    ([remap other-window] . switch-window))
#+END_SRC

